#define _CRT_SECURE_NO_DEPRECATE 
#include <stdio.h> 
#include <time.h> 
#include <math.h> 
#include <locale.h> 
struct tm* mytime;
time_t t;
void main() {
    setlocale(0, "rus");
    t = time(NULL);
    mytime = localtime(&t);
    printf("***********************************************************************************************************************\n");
    printf("*************************************************Время по Московскому времени %02d:%02d:%02d***************************\n", mytime->tm_hour, mytime->tm_min, mytime->tm_sec);
    printf("*********************************************сегодня %d день %d года***************************************************\n", (mytime->tm_yday), mytime->tm_year+1900);
    printf("***********************************************************************************************************************");
}
